/***************************************************************************/
/*                              Search.c                                   */
/***************************************************************************/

#include <stdio.h>

#include "an_r.h"

const LINE search_list[] = {
"андропов",      "черненко",    "брежнев",   "генсек",      "политбюро",
"громыко",       "хрущев",      "сталин",    "рейган",      "ельцин",
"дзержинск",     "феликс",      "горбачев",  "перестройка", "кгб",
"колхоз",        "коммун",      "социал",    "комсомол",    "троцкий",
"ульянов",       "ильич",       "владимир",  "ленин",       "армия",
"командир",      "воен",        "офицер",    "курсант",     "солдат",
"генерал",       "старшина",    "рядовой",   "сержант",     "капитан",
"полковник",     "прапорщик",   "лейтенант", "майор",       "абрам",
"раввин",        "сара",        "исаак",     "изя",         "хаим",
"ребе",          "рабинович",   "америка",   "китай",       "китае",
"англ",          "лорд",        "джент",     "армян",       "армен",
"гоги",          "джигит",      "грузин",    "чукча",       "шотланд",
"цыган",         "узбек",       "русский",   "габров",      "прибалт",
"эстон",         "латыш",       "литов",     "одесс",       "сибир",
"негр",          "украин",      "хохол",     "москал",      "париж",
"франц",         "месье",       "алкаш",     "пиво",        "пьян",
"водк",          "алкогол",     "хип",       "нарк",        "косяк",
"панк",          "доктор",      "больниц",   "больной",     "венеролог",
"гинеколог",     "аптек",       "пациент",   "врач",        "хирург",
"дистрофик",     "дантист",     "дурдом",    "псих",        "секс",
"заика",         "заяц",        "ежик",      "зверь",       "комар",
"корова",        "кошк",        "крокоди",   "лошад",       "лягушк",
"медведь",       "муравей",     "обезьян",   "петух",       "рыбка",
"орел",          "удав",        "волк",      "соловей",     "собак",
"лиса",          "слон",        "клоп",      "попугай",     "ворона",
"бык",           "авиа",        "автобус",   "автомоби",    "авто",
"трамва",        "транспорт",   "пилот",     "поезд",       "машин",
"метро",         "дорог",       "железнодоро", "троллейбус","гаи",
"милиц",         "полиц",       "мент",      "хокке",       "футбол",
"спорт",         "преподават",  "профессор", "универ",      "учены",
"студент",       "институт",    "вуз",       "рыбак",       "рыбалк",
"рыболов",       "охотник",     "начальн",   "моряк",       "маляр",
"клиент",        "ковбо",       "поп",       "корол",       "директор",
"инспек",        "людоед",      "экономист", "шофер",       "фермер",
"учитель",       "альпинист",   "водопро",   "строит",      "стюард",
"агент",         "адвокат",     "священни",  "секретар",    "продав",
"прораб",        "мастер",      "бригад",    "портно",      "покупат",
"официант",      "ресторан",    "парикмах",  "закон",       "кирпич",
"чумак",         "кашпировск",  "ватсон",    "холмс",       "штирлиц",
"суворов",       "тамерлан",    "subj",      "сабж",        "субж",
"сникерс",       "колобок",     "гена",      "чебурашк",    "карлсон",
"поручик",       "ржевск",      "ростов",    "богатыр",     "алеша",
"добрын",        "муром",       "пятач",     "винни",       "петьк",
"василий",       "анка",        "чапаев",    "вовочк",      "насреддин",
"горыныч",       "гном",        "карлик",    "гомосе",      "садист",
"upsa",          "упса",        "молодо",    "развод",      "свадьба",
"новобрачн",     "измен",       "любов",     "холост",      "мать",
"супруг",        "сын",         "теща",      "дед",         "дочка",
"дочь",          "мама",        "папа",      "родител",     "сестра",
"семья",         "бабушка",     "брат",      "дети",        "женщин",
"дама",          "девочк",      "девушк",    "мальчик",     "парень",
"золото",        "зуб",         "интел",     "кино",        "магазин",
"мистер",        "монашк",      "музык",     "отель",       "театр",
"телефон",       "цирк",        "школ",      "презерватив", "пенсионер",
"анекдот",       "хозяин",      "партизан",  "сосед",       "турист",
"гости",         "архангел",    "бог",       "христ",       "порно",
"лампочка",      "судья",
};

const int max_kwd = sizeof (search_list) / sizeof (LINE);

/**********************************************************************/
void Search_Print (long random_number) {
  if (Flags_Get_Language() == ENGLISH)
     return;
  printf ("<form action=%s method=POST target=_blank>\n", SEARCH_PATH);
  printf ("<a href=/an_search.htm>Расширенный</a>\n");
  printf (" поиск анекдотов &nbsp\n");
  printf ("<input type=text name=p size=35 value=\"%s\">\n",
            search_list[(int)(random_number % max_kwd)]);
  printf ("<input type=submit value=\"Найти\">\n");
  printf ("</form>\n");
  printf ("<hr>\n");
}

